-- Remove letter accents
-- coding: utf-8 'ä
function noAccent(str)
  local accents = {
    ["à"]="a", ["á"]="a", ["â"]="a", ["ã"]="a", ["ä"]="a", ["å"]="a",
    ["æ"]="ae",
    ["ç"]="c",
    ["è"]="e", ["é"]="e", ["ê"]="e", ["ë"]="e",
    ["ì"]="i", ["í"]="i", ["î"]="i", ["ï"]="i",
    ["ð"]="d",
    ["ñ"]="n",
    ["ò"]="o", ["ó"]="o", ["ô"]="o", ["õ"]="o", ["ö"]="o", ["ø"]="o",
    ["ù"]="u", ["ú"]="u", ["û"]="u", ["ü"]="u",
    ["ý"]="y",
    ["ÿ"]="y",
    -- Uppercase
    ["À"]="A", ["Á"]="A", ["Â"]="A", ["Ã"]="A", ["Ä"]="A", ["Å"]="A",
    ["Æ"]="AE",
    ["Ç"]="C",
    ["È"]="E", ["É"]="E", ["Ê"]="E", ["Ë"]="E",
    ["Ì"]="I", ["Í"]="I", ["Î"]="I", ["Ï"]="I",
    ["Ð"]="D",
    ["Ñ"]="N",
    ["Ò"]="O", ["Ó"]="O", ["Ô"]="O", ["Õ"]="O", ["Ö"]="O", ["Ø"]="O",
    ["Ù"]="U", ["Ú"]="U", ["Û"]="U", ["Ü"]="U",
    ["Ý"]="Y"
  }
  local txt = ""
  for char in string.gmatch(str, "([%z\1-\127\194-\244][\128-\191]*)") do
    txt = txt .. (accents[char] or char)
  end
  return txt
end
